app/views/posts/show.html.erb

<% if current_user %>
    <% if Favorite.exists?(category_id: @post.category.id, user_id: current_user.id) %>
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."category_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["category_id", 1], ["user_id", 1], ["LIMIT", 1]]