app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @posts = Post.all
    @categories = Category.all

INSERT INTO "posts" ("user_id", "category_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["category_id", 1], ["title", "sdfdsfdsfsdf"], ["body", "sdfsdfsf"], ["created_at", 2017-05-23 09:11:07 UTC], ["updated_at", 2017-05-23 09:11:07 UTC]]
---
  def create
    post = Post.new(post_params)
    post.user_id = current_user.id
    if post.save