app/controllers/users_controller.rb

SELECT "favorites".* FROM "favorites" WHERE (user_id = 1)
---
  def index
    @favorites = Favorite.where("user_id = ?", current_user.id)

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save